In [1]:
import pandas as pd
import numpy as np

Given a dataset----
Replace "N/A" and "?" with np.nan.
Drop columns with >50% nulls.
Fill remaining nulls with mean (for numeric) or mode (for categorical).

In [3]:
data = {'col1': [1, 2, 'N/A', 4, 5, '?', 7, 8, np.nan, 10],
        'col2': ['A', '?', 'A', 'N/A', 'E', 'F', '?', 'A', 'I', 'J'],
        'col3': [100, 200, 300, 400, 500, '?', 700, 'N/A', 900, 1000],
        'col4': [np.nan, np.nan, np.nan, np.nan, 5, np.nan, 7, np.nan, 9, 10], 
        'col5': ['X', 'Y', 'Z', 'X', 'Y', 'Z', 'X', 'Y', 'Z', np.nan],
        'col6': [np.nan, np.nan, np.nan, np.nan, np.nan, np.nan, np.nan, np.nan, np.nan, np.nan] 
       }

In [4]:
df = pd.DataFrame(data)

In [5]:
df

  col1 col2  col3  col4 col5  col6
0    1    A   100   NaN    X   NaN
1    2    ?   200   NaN    Y   NaN
2  N/A    A   300   NaN    Z   NaN
3    4  N/A   400   NaN    X   NaN
4    5    E   500   5.0    Y   NaN
5    ?    F     ?   NaN    Z   NaN
6    7    ?   700   7.0    X   NaN
7    8    A   N/A   NaN    Y   NaN
8  NaN    I   900   9.0    Z   NaN
9   10    J  1000  10.0  NaN   NaN

In [6]:
df.replace(['N/A', '?'], np.nan, inplace=True)

/tmp/ipykernel_15929/2871576727.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df.replace(['N/A', '?'], np.nan, inplace=True)

df.replace() offers
single value replacements,
multiple value replacements, 
replacements based on regular expressions.

Syntax-- df.replace(to_replace, value, inplace=False, regex=False)

to_replace: The value(s) to be replaced. This can be a 
single value,
list of values, 
dictionary mapping old values to new values,
regular expression.


value: The value(s) to replace with. This can be a 
single value, 
list of values (when to_replace is a list), 
omitted if to_replace is a dictionary.

#### Drop col with more than 50% null values

In [7]:
null_count = df.isna().sum()
null_count

col1     3
col2     3
col3     2
col4     6
col5     1
col6    10
dtype: int64

In [8]:
null_percentage = (null_count/len(df))*100
null_percentage

col1     30.0
col2     30.0
col3     20.0
col4     60.0
col5     10.0
col6    100.0
dtype: float64

In [9]:
null_percentage[null_percentage>50]

col4     60.0
col6    100.0
dtype: float64

In [10]:
col_to_drop = null_percentage[null_percentage > 50].index
col_to_drop

Index(['col4', 'col6'], dtype='object')

In [11]:
df.drop(columns=col_to_drop, inplace=True)

In [12]:
df

   col1 col2    col3 col5
0   1.0    A   100.0    X
1   2.0  NaN   200.0    Y
2   NaN    A   300.0    Z
3   4.0  NaN   400.0    X
4   5.0    E   500.0    Y
5   NaN    F     NaN    Z
6   7.0  NaN   700.0    X
7   8.0    A     NaN    Y
8   NaN    I   900.0    Z
9  10.0    J  1000.0  NaN

In [40]:
df['col2'].fillna(df['col2'].mode()[0])

0    A
1    A
2    A
3    A
4    E
5    F
6    A
7    A
8    I
9    J
Name: col2, dtype: object

In [20]:
df['col3'].fillna(df['col3'].median())

0     100.0
1     200.0
2     300.0
3     400.0
4     500.0
5     450.0
6     700.0
7     450.0
8     900.0
9    1000.0
Name: col3, dtype: float64

In [37]:
df['col5'].fillna(df['col5'].mode()[0])

0    X
1    Y
2    Z
3    X
4    Y
5    Z
6    X
7    Y
8    Z
9    X
Name: col5, dtype: object

In [36]:
df['col1'].fillna(df['col1'].mean()).astype(int)

0     1
1     2
2     5
3     4
4     5
5     5
6     7
7     8
8     5
9    10
Name: col1, dtype: int64

mode() method always returns a Pandas Series, even if there is only one mode. This is because a dataset can have multiple modes.
.mode()[0]) is used to select the first mode found in the Series returned by the mode() method.